Revit 2027 API
ParameterTypeId.PointFlexibleOrientationType Property
 "Orientation"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId PointFlexibleOrientationType { get; }
Public Shared ReadOnly Property PointFlexibleOrientationType As ForgeTypeId
	Get
public:
static property ForgeTypeId^ PointFlexibleOrientationType {
	ForgeTypeId^ get ();
}
static member PointFlexibleOrientationType : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace